## Pandas DataFrame

판다스에서 데이터( 테이블 형태 - DB, 엑셀, CSV , json) 처리하는 기본단위 자료구조

<img src='https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99FD8D385BFBECE32D' width=500>

데이터 프레인 생성
```
pd.DataFrame(...)
```

In [2]:
import pandas as pd

In [3]:
# 데이터프레임 생성
data = {
    '이름' : ['홍길동','홍길순','성유고','박예슬'],
    '국어' : [80, 100, 10, 90],
    '영어' : [50, 100, 99 ,100],
    '수학' : [90, 100, 10, 40],
    '미술' : [100, 100, 99, 30]
} # 기본데이터 실제로는 excel, db, cvs, openAPI 등 다른곳에서 받아와서 변환

df1 = pd.DataFrame(data=data)
df1

    이름   국어   영어   수학   미술
0  홍길동   80   50   90  100
1  홍길순  100  100  100  100
2  성유고   10   99   10   99
3  박예슬   90  100   40   30

#### 특정컬럼 사용

In [4]:
data

{'이름': ['홍길동', '홍길순', '성유고', '박예슬'],
 '국어': [80, 100, 10, 90],
 '영어': [50, 100, 99, 100],
 '수학': [90, 100, 10, 40],
 '미술': [100, 100, 99, 30]}

In [5]:
df2 = pd.DataFrame(data=data, columns=['이름','영어'])
df2

    이름   영어
0  홍길동   50
1  홍길순  100
2  성유고   99
3  박예슬  100

In [6]:
pd.DataFrame(data=data, columns=['이름','미술','음악'])

    이름   미술   음악
0  홍길동  100  NaN
1  홍길순  100  NaN
2  성유고   99  NaN
3  박예슬   30  NaN

In [7]:
pd.DataFrame(data=data, index=[x for x in range(1,len(data))])

    이름   국어   영어   수학   미술
1  홍길동   80   50   90  100
2  홍길순  100  100  100  100
3  성유고   10   99   10   99
4  박예슬   90  100   40   30

In [9]:
pd.DataFrame(data=data, index=['첫번째','두번째','세번째','네번째'])

      이름   국어   영어   수학   미술
첫번째  홍길동   80   50   90  100
두번째  홍길순  100  100  100  100
세번째  성유고   10   99   10   99
네번쩨  박예슬   90  100   40   30

#### DF내의 데이터 조회

In [10]:
df1['이름']

0    홍길동
1    홍길순
2    성유고
3    박예슬
Name: 이름, dtype: object

In [11]:
type(df1['국어'])

pandas.core.series.Series

In [12]:
df1[['이름','수학']]

    이름   수학
0  홍길동   90
1  홍길순  100
2  성유고   10
3  박예슬   40

In [13]:
type(df1[['이름','수학']])

pandas.core.frame.DataFrame

In [14]:
# DF의 인덱스 기준으로 데이터 조회
df1.loc[1]

이름    홍길순
국어    100
영어    100
수학    100
미술    100
Name: 1, dtype: object

In [15]:
df1.loc[[0,2]]

    이름  국어  영어  수학   미술
0  홍길동  80  50  90  100
2  성유고  10  99  10   99